In [1]:
import os
import csv
import pandas as pd
import numpy as np
import regex as re

In [2]:
zip_code = "Data Set/zip_code.csv"
zip_code_df = pd.read_csv(zip_code)
zip_code_df.head()

,ZIP,Neighborhood,Borough,Cases,"Cases per 100,000","Deaths per 100,000",Percent positive<br>(of people tested)
0,10001,Chelsea/NoMad/West Chelsea,Manhattan,420,1782.45,106.10,6.95
1,10002,Chinatown/Lower East Side,Manhattan,1237,1611.61,208.45,10.00
2,10003,East Village/Gramercy/Greenwich Village,Manhattan,516,959.08,63.20,5.39
3,10004,Financial District,Manhattan,39,1068.32,27.39,6.04
4,10005,Financial District,Manhattan,81,964.73,23.82,5.31

In [3]:
median = "Data Set/median_incomes.csv"
median_income_df = pd.read_csv(median, quoting=csv.QUOTE_MINIMAL, skipinitialspace=True, )
median_income_df.head()

         Location  Household Type  TimeFrame DataFormat          Data  Fips
0       Riverdale  All Households       2005    Dollars   $60,686.22    208
1  Williamsbridge  All Households       2005    Dollars   $49,881.99    212
2     Throgs Neck  All Households       2005    Dollars   $55,211.29    210
3  Pelham Parkway  All Households       2005    Dollars   $50,494.64    211
4      Morrisania  All Households       2005    Dollars   $23,524.24    203

In [4]:
median_income_df.dtypes

Location          object
Household Type    object
TimeFrame          int64
DataFormat        object
Data              object
Fips               int64
dtype: object

In [5]:
spec_chars = ["$"]


for char in spec_chars:
    median_income_df['Data'] = median_income_df['Data'].str.replace(char, ' ')

median_income_df.head()

         Location  Household Type  TimeFrame DataFormat          Data  Fips
0       Riverdale  All Households       2005    Dollars    60,686.22    208
1  Williamsbridge  All Households       2005    Dollars    49,881.99    212
2     Throgs Neck  All Households       2005    Dollars    55,211.29    210
3  Pelham Parkway  All Households       2005    Dollars    50,494.64    211
4      Morrisania  All Households       2005    Dollars    23,524.24    203

In [6]:
median_income_df['Data'] = median_income_df['Data'].str.split().str.join(" ")

In [7]:
median_income_df.head()

         Location  Household Type  TimeFrame DataFormat       Data  Fips
0       Riverdale  All Households       2005    Dollars  60,686.22   208
1  Williamsbridge  All Households       2005    Dollars  49,881.99   212
2     Throgs Neck  All Households       2005    Dollars  55,211.29   210
3  Pelham Parkway  All Households       2005    Dollars  50,494.64   211
4      Morrisania  All Households       2005    Dollars  23,524.24   203

In [8]:
# median_income_df['Data'] =  median_income_df['Data'].astype(float)
# median_income_df

In [9]:
median_income_df.dtypes

Location          object
Household Type    object
TimeFrame          int64
DataFormat        object
Data              object
Fips               int64
dtype: object

In [10]:
median_income_df

,Location,Household Type,TimeFrame,DataFormat,Data,Fips
0,Riverdale,All Households,2005,Dollars,"60,686.22",208
1,Williamsbridge,All Households,2005,Dollars,"49,881.99",212
2,Throgs Neck,All Households,2005,Dollars,"55,211.29",210
3,Pelham Parkway,All Households,2005,Dollars,"50,494.64",211
4,Morrisania,All Households,2005,Dollars,"23,524.24",203
...,...,...,...,...,...,...
3635,Brooklyn,Families without Children,2018,Dollars,"75,720.00",36047
3636,Manhattan,Families without Children,2018,Dollars,"103,820.00",36061
3637,Queens,Families without Children,2018,Dollars,"79,013.00",36081
3638,Staten Island,Families without Children,2018,Dollars,"106,260.00",36085
3639,New York City,Families without Children,2018,Dollars,"77,141.00",3651000

In [11]:
# median_income_df[' Data'] = median_income_df.

In [12]:
# median_income_df.rename(columns = { "Data" : "Average Household Income"}, inplace = True)

In [13]:
#All I did so far was import the CSVs. I'm trying to merge them by borough. So before that we
#need to clean the zip code data to be grouped by borough. Sum it mayeb? idk
#Then under location in the median income df at the end of each year is the overall amount for
# the boroughs. we need to trim the old data and the data keep only 2018. Then just use the borough
#numbers not the neighborhood numbers

In [14]:

df_filtered_year = median_income_df.loc[(median_income_df["TimeFrame"] == 2018)]
df_filtered_household = df_filtered_year.loc[(df_filtered_year["Household Type"] == "All Households")]
df_filtered_household.tail(6)
#df_filtered_household.sort_values(by=['Data'], ascending=False )
almost_done = df_filtered_household.drop(df_filtered_household.index[0:59])
#almost_done.head(6)
column = almost_done.drop(almost_done.index[5])
#column.head(10)
final = column.drop(columns=['Household Type', 'DataFormat', 'Fips'])
#final.head()

# final_median = final.rename(columns={"Location": "Borough", "TimeFrame": "Year", " Data": "Average Household Income"})
# final_median.head()

In [15]:
final.columns = ["Borough", "Year", "average_household_income"]
final

            Borough  Year average_household_income
3439          Bronx  2018                38,467.00
3440       Brooklyn  2018                61,220.00
3441      Manhattan  2018                85,066.00
3442         Queens  2018                69,320.00
3443  Staten Island  2018                82,166.00

In [16]:
average_household_income = average_household_income.astype(float)

NameError: name 'average_household_income' is not defined

In [ ]:
final

In [ ]:

final['average_household_income'] = pd.to_numeric(final['average_household_income'])

In [ ]:
# final['Average Household Income'] = final['Average Household Income'].astype(float)